import pandas as pd

data = {
    "球队": ["皇马","曼城","拜仁","利物浦","皇马","曼城","拜仁"],
    "赛季": ["2023","2023","2023","2023","2024","2024","2024"],
    "进球": [45, 52, 38, 41, 50, 48, 42],
    "失球": [25, 30, 22, 28, 27, 29, 24],
    "胜场": [18, 20, 15, 16, 22, 19, 17]
}
    

df = pd.DataFrame(data)
#按球队统计：总进球、平均进球、最高进球
#总胜场、平均胜场
#按赛季统计平均进球和总胜场
grouped1=df.groupby("球队")
result1=grouped1.agg(
    平均进球=("进球","mean"),
    总进球=("进球","sum"),
    最高进球=("进球","max"),
    平均胜场=("胜场","mean"),
    总胜场=("胜场","sum")
)
print(result1)
result2=grouped1.agg({
    "进球":['sum','mean','max'],
    "胜场":['sum','mean']
})
print(result2)